app/views/projects/_associated_inputs_modal.html.erb

SELECT "features".* FROM "features" INNER JOIN "features_projects" ON "features"."id" = "features_projects"."feature_id" WHERE "features_projects"."project_id" = $1  ORDER BY position, level  [["project_id", 1]]
SELECT "users".* FROM "users"  ORDER BY email, first_name, profesor
---
		<% if @label == "Badges" %>
			<%= f.association :features, as: :check_boxes, label: @label, collection: Feature.includes(:field).reorder('fields.parent_id, features.field_id, level').all.map { |f| [f.name_for_associated_inuts, f.id] } %>
		<% elsif @label == "Membres" %>
			<%= f.association :users, as: :check_boxes, label: @label, collection: User.reorder('email, first_name, profesor').all.map { |f| [f.name_for_associated_inuts, f.id] } %>