app/views/projects/_form.html.erb

SELECT "workshops".* FROM "workshops"
---
  <%= f.input :description %>
  <%= f.input :workshop_id, collection: Workshop.all %>

SELECT "features".* FROM "features" INNER JOIN "features_projects" ON "features"."id" = "features_projects"."feature_id" WHERE "features_projects"."project_id" = $1  ORDER BY position, level  [["project_id", 1]]
SELECT "fields".* FROM "fields" WHERE "fields"."id" IN (9, 16, 8, 10, 6, 18, 12)  ORDER BY parent_id, position
---
  <br/>
  <%= render :partial => "project_associated_inputs", :locals => {input_values: @project.features.includes(:field).where("status = 2").references(:features).reorder('fields.parent_id, features.field_id, level').all.map, :input_name=>"project[feature_ids][]", :input_class=>"features_projects", :label=>"Badges", :add_button_label=>"Ajouter un badge", :dropdown_button_label=>"Ajouter des badges depuis la liste"} %>