app/views/projects/_statsDetails.html.erb

SELECT "features".* FROM "features" INNER JOIN "features_projects" ON "features"."id" = "features_projects"."feature_id" WHERE "features_projects"."project_id" = $1  ORDER BY position, level  [["project_id", 1]]
SELECT COUNT(*) FROM "features"
---
<%#On récupère le nombre total de badges validés du projet%>
<%featuresChecked=project.features.map {|c|c.name}.count()%>

SELECT "features".* FROM "features" WHERE "features"."field_id" = $1  ORDER BY position, level  [["field_id", 8]]
---
<% @fieldsParents.each do |field| %>
    <% field.all_features.each do |feature| %>

SELECT "workshops"."dateFin" FROM "workshops" WHERE ('dateFin' >'2016-11-21') AND "workshops"."id" = $1  [["id", 1]]
---
<%# Calcul du nombre de jours restants %>
<% dateFin=@workshops.where(id: project.workshop_id).pluck(:dateFin)[0].to_date %>

SELECT COUNT(case when date_demande IS NOT NULL THEN 0 end) AS count_case_when_date_demande_is_not_null_then_0_end, name AS name, (DATE_TRUNC('day', (date_demande::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS day FROM "projects" INNER JOIN users_projects ON projects.id=users_projects.project_id LEFT JOIN features_projects ON features_projects.project_id = projects.id WHERE (users_projects.user_id= 17) AND (features_projects.project_id=1) AND (date_demande IS NOT NULL) GROUP BY "projects"."name", (DATE_TRUNC('day', (date_demande::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'  ORDER BY name
---

<%=line_chart @projects.joins("LEFT JOIN features_projects ON features_projects.project_id = projects.id").where("project_id=?",project.id).group(:name).group_by_day(:date_demande).count("case when date_demande IS NOT NULL THEN 0 end"),:name => "Badge(s) demandé(s)", colors: ["#014B4C","#012322","#0D7979"] %>