app/views/projects/_stats.html.erb

<% projects.each do |project| %>
		<% data[project.name] = project.features.map {|c|c.name}.count() %>
---
SELECT "features".* FROM "features" INNER JOIN "features_projects" ON "features"."id" = "features_projects"."feature_id" WHERE "features_projects"."project_id" = $1  ORDER BY position, level  [["project_id", 1]]
SELECT COUNT(*) FROM "features"