app/views/projects/index.html.erb

<%# On ne peut créer un nouveau projet  seulement si il existe au moins un Workshop%>
<% if Workshop.any?%>
---
SELECT COUNT(*) FROM "workshops"