app/controllers/dashboard_controller.rb

SELECT "fields".* FROM "fields" WHERE "fields"."parent_id" = $1  ORDER BY parent_id, position  [["parent_id", 1]]
SELECT "workshops".* FROM "workshops" WHERE ('dateFin' >'2016-11-21')
SELECT "workshops".* FROM "workshops"
SELECT "features_projects".* FROM "features_projects" INNER JOIN projects ON features_projects.project_id=projects.id WHERE (status=1)
---
  def index
    @fields = Field.all

    @parent_fields = Field.all.where(parent_id: nil)

    if (params[:filter].eql?("inprogress"))
      @workshops=Workshop.where("'dateFin' >?",Time.now.to_date)
    elsif (params[:filter].eql?("end"))
      @workshops=Workshop.where("'dateFin' <=?",Time.now.to_date)
    else
      @workshops = Workshop.all
    end

    # Pour les professeurs, on affiche la liste des features demandées, pour les étudiants on affiche la liste des réponses, et des features en attente
    if current_user.profesor?
    @demandesValidation=FeaturesProject.joins(" inner join users_projects on features_projects.project_id=users_projects.project_id").where("features_projects.status=? and users_projects.user_id=?",1,current_user.id)