app/controllers/features_controller.rb

  def index
    @fields = Field.all.where(parent_id: nil)
---
SELECT "fields".* FROM "fields" WHERE "fields"."parent_id" = $1  ORDER BY parent_id, position  [["parent_id", 1]]

  def show
    @projects = Project.all
---
SELECT "projects".* FROM "projects"  ORDER BY name

    def set_feature
      @feature = Feature.find(params[:id])
---
SELECT  "features".* FROM "features" WHERE "features"."id" = $1  ORDER BY position, level LIMIT 1  [["id", 1]]