app/controllers/fields_controller.rb

  def index
    @fields = Field.all
---
SELECT "fields".* FROM "fields"  ORDER BY parent_id, position

    def set_field
      @field = Field.find(params[:id])
---
SELECT  "fields".* FROM "fields" WHERE "fields"."id" = $1  ORDER BY parent_id, position LIMIT 1  [["id", 1]]