app/controllers/projects_controller.rb

  def index

# L'utilisateur n'a accès qu'aux projets auxquels il est assigné (si il est élève)
    if(!current_user.admin? && !current_user.profesor?)
      @projects = Project.joins("INNER JOIN users_projects ON projects.id=users_projects.project_id").where("users_projects.user_id= ?",current_user.id)
    else
      @projects=Project.all
---
SELECT "projects".* FROM "projects" INNER JOIN users_projects ON projects.id=users_projects.project_id WHERE (users_projects.user_id= 12)  ORDER BY name
SELECT "projects".* FROM "projects"  ORDER BY name

  def show
    @fields = Field.all

    @parent_fields = Field.all.where(parent_id: nil)


    @projects = Project.joins("INNER JOIN users_projects ON projects.id=users_projects.project_id").where("users_projects.user_id= ?",current_user.id)
    @fieldsParents = Field.all.where(parent_id: nil)
    @featuresSearch= Feature.search(params[:search])
    @features= Feature.all
    @workshops=Workshop.all

    @featuresProject=FeaturesProject.all
    @badgesAttente=FeaturesProject.joins("INNER JOIN projects ON features_projects.project_id=projects.id").where("status=1")
---
SELECT "fields".* FROM "fields" WHERE "fields"."parent_id" = $1  ORDER BY parent_id, position  [["parent_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "users_projects" ON "users"."id" = "users_projects"."user_id" WHERE "users_projects"."project_id" = $1  ORDER BY last_name, first_name  [["project_id", 1]]
SELECT  "features_projects".* FROM "features_projects" WHERE (project_id=1 and feature_id=1) LIMIT 1
SELECT "features_projects".* FROM "features_projects" INNER JOIN projects ON features_projects.project_id=projects.id WHERE (status=1)

  def update
    if !params[:data].nil?
      @projectsfeature = FeaturesProject.where(["project_id=? and feature_id=?", params[:id], params[:data][:feature_id]]).first
---
SELECT  "features_projects".* FROM "features_projects" WHERE (project_id='1' and feature_id='1') LIMIT 1
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1  ORDER BY name LIMIT 1  [["id", 2]]

  def autocomplete_feature
    if params[:term]
      @autocomplete_values = ""
      if params[:type] == "users_projects"
        @autocomplete_values = User.where('first_name ILIKE ? OR last_name ILIKE ? OR email ILIKE ?', "%#{params[:term].downcase}%", "%#{params[:term].downcase}%", "%#{params[:term].downcase}%")
      elsif params[:type] == "features_projects"
        @autocomplete_values = Feature.where('name ILIKE ?', "%#{params[:term].downcase}%")
---
SELECT "users".* FROM "users" WHERE (first_name ILIKE '%toto%' OR last_name ILIKE '%toto%' OR email ILIKE '%toto%')  ORDER BY last_name, first_name
SELECT "features".* FROM "features" WHERE (name ILIKE '%mod%')  ORDER BY position, level

  def get_add_from_list_modal
    if params[:id].nil?
      @project = Project.new
    else
      @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1  ORDER BY name LIMIT 1  [["id", 1]]

  def set_project
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1  ORDER BY name LIMIT 1  [["id", 1]]