app/controllers/users_controller.rb

  def index
    @users = User.where.not(admin: true).all
---
SELECT "users".* FROM "users" WHERE (lower(first_name) LIKE lower('%l%') OR lower(last_name) LIKE lower('%l%') OR lower(email) LIKE lower('%l%')) AND ("users"."admin" != 't')  ORDER BY last_name, first_name

  def update_me
    @user = current_user
    @user.update params.require(:user).permit(:first_name, :last_name, :diploma_year)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", ""], ["last_name", ""], ["updated_at", "2016-11-23 15:56:08.577667"], ["id", 17]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY last_name, first_name LIMIT 1  [["id", 17]]