app/controllers/workshops_controller.rb

  def index
    @workshops = Workshop.all
---
SELECT "workshops".* FROM "workshops"

  def show
    @features = Feature.all
    @projects= Project.all
---
SELECT "features".* FROM "features"  ORDER BY position, level
SELECT "projects".* FROM "projects" WHERE "projects"."workshop_id" = $1  ORDER BY name  [["workshop_id", 1]]

    def set_workshop
      @workshop = Workshop.find(params[:id])
---
SELECT  "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT 1  [["id", 1]]